app/controllers/accessories_controller.rb

  def index
    @accessories = Accessory.all
---
SELECT "accessories".* FROM "accessories"