app/controllers/mobiles_controller.rb

SELECT "mobiles".* FROM "mobiles"
---
  def index
    @mobiles = Mobile.all

INSERT INTO "mobiles" ("title", "model", "color", "price", "discription", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", "samsung"], ["model", "s8"], ["color", "blue"], ["price", 12000], ["discription", "good"], ["created_at", "2018-11-11 12:48:36.646466"], ["updated_at", "2018-11-11 12:48:36.646466"]]
---
  def create
    @mobile = Mobile.new(mobile_params)

    respond_to do |format|
      if @mobile.save

SELECT  "mobiles".* FROM "mobiles" WHERE "mobiles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_mobile
      @mobile = Mobile.find(params[:id])